PeterVranken/TRK-USB-MPC5643L/LSM/RTuinOS/code/startup/ihw_initMcuCoreHW.c
    /* PLL 0 runs at 120 MHz. */
    CGM.FMPLL[0].CR.B.IDF = 0x5;    /* FMPLL0 IDF=5 --> divide by 5+1=6 */
    CGM.FMPLL[0].CR.B.ODF = 0x1;    /* FMPLL0 ODF=1 --> divide by 2^(1+1)=4 */
    CGM.FMPLL[0].CR.B.NDIV = 72;    /* FMPLL0 NDIV=72 --> divide by 72 */
    CGM.FMPLL[0].CR.B.EN_PLL_SW = 1;/* Enable progressive clock switching for PLL 0 */

    /* We do not make use of the modulation capabilities of the PLLs and can thus use the
       same PLL for both CPU and peripherals. */
#if 0
    /* PLL 1 runs at 80 MHz */
    CGM.FMPLL[1].CR.B.IDF = 0x7;    /* FMPLL0 IDF=7 --> divide by 7+1=8 */
    CGM.FMPLL[1].CR.B.ODF = 0x1;    /* FMPLL0 ODF=1 --> divide by 2^(1+1)=4*/
    CGM.FMPLL[1].CR.B.NDIV = 64;    /* FMPLL0 NDIV=64 --> divide by 64 */
    CGM.FMPLL[1].CR.B.EN_PLL_SW = 1;/* Enable progressive clock switching for PLL 1*/
#endif

    ME.RUNPC[0].R = 0x000000FE;     /* Enable peripherals run in all modes. */
    ME.LPPC[0].R = 0x00000000;      /* Disable peripherals run in LP modes. */

    /* Mode Transition to enter RUN0 mode: */
#if 0
    ME.RUN[0].R = 0x001F00F4;       /* RUN0 cfg: 16MHzIRCON,OSC0ON,PLL0ON,PLL1ON,syclk=PLL0 */
#else
    ME.RUN[0].R = 0x001F0074;       /* RUN0 cfg: 16MHzIRCON,OSC0ON,PLL0ON,syclk=PLL0 */
#endif
    ME.MCTL.R = 0x40005AF0;         /* Enter RUN0 Mode & Key */
    ME.MCTL.R = 0x4000A50F;         /* Enter RUN0 Mode & Inverted Key */

    /* Wait for mode transition to complete */
    while(ME.GS.B.S_MTRANS == 1)
    {}
    /* Check RUN0 mode has been entered */
    while(ME.GS.B.S_CURRENT_MODE != 4)
    {}

    /* Configure the connection of the peripheral clock to the system clock. The PLL can be
       chosen and a divider. */
    CGM.AC0SC.R = 0x04000000;   /* Select PLL0 for aux clk 0.  */
    CGM.AC0DC.R = 0x80800000;   /* Enable PLL0 div by 1 as motor control and sine wave
                                   generator clock. See MCU ref. manual 11.3.1.5., p.225f. */
    CGM.AC1SC.R = 0x04000000;   /* Select PLL0 for aux clk 1.  */
    CGM.AC1DC.R = 0x80000000;   /* Enable PLL0 div by 1 as FlexRay clock. See MCU ref.
                                   manual 11.3.1.8., p.227. */
    CGM.AC2SC.R = 0x04000000;   /* Select PLL0 for aux clk 2  */
    CGM.AC2DC.R = 0x80000000;   /* Enable PLL0 div by 1 as FlexCAN clock. See MCU ref.
                                   manual 11.3.1.10., p.228f. */

    /* Enable CLKOUT on PB6. */
    if(enableClkOutputAtPB6)
    {
        SIU.PCR[22].R = 0x0600;     /* ALT1 - PCR[22] - PA = 0b01 */

        /* set CLKOUT divider of 4 */
        CGM.OCDSSC.B.SELDIV = 0x2;  /* Output selected Output Clock divided by 4. */
        CGM.OCDSSC.B.SELCTL = 0x2;  /* System PLL. */
        CGM.OCEN.B.EN = 1;          /* Enable CLKOUT signal. */
    }
    else
        CGM.OCEN.B.EN = 0;          /* Disable CLKOUT signal. */

} /* End of initModesAndClks */




/**
 * Basic configuration of the peripheral bridge. A general purpose setting is chosen,
 * suitable for all of the samples in this project: All masters can access the peripherals
 * without access protection for any of them.
 *   @remark
 * A true application would tend to do the peripheral bridge configuration much more
 * restrictive!
 */
static void initPBridge()
{
    /* Peripheral bridge is completely open; all masters can go through AIPS and the
       peripherals have no protection. */
    AIPS.MPROT0_7.R   = 0x77777777;
    AIPS.MPROT8_15.R  = 0x77000000;
    AIPS.PACR0_7.R    = 0x0;
    AIPS.PACR8_15.R   = 0x0;
    AIPS.PACR16_23.R  = 0x0;

    AIPS.OPACR0_7.R   = 0x0;
    AIPS.OPACR16_23.R = 0x0;
    AIPS.OPACR24_31.R = 0x0;
    AIPS.OPACR32_39.R = 0x0;
    AIPS.OPACR40_47.R = 0x0;
    AIPS.OPACR48_55.R = 0x0;
    AIPS.OPACR56_63.R = 0x0;
    AIPS.OPACR64_71.R = 0x0;
    AIPS.OPACR80_87.R = 0x0;
    AIPS.OPACR88_95.R = 0x0;

} /* End of initPBridge */



/**
 * Dummy interrupt handler. On initialization of the INTC
 * (initINTCInterruptController()), this function is put into all 256 interrupt vectors
 * in the table.\n
 *   The dummy handler can't reasonably service the interrupt. It would need to know the
 * source of interrupt to acknowledge the interrupt there (mostly the interrupt bit in the
 * status word of an I/O device needs to be cleared). Without doing this acknowledge, the
 * same interrupt would be served immediately again after return from the handler. This is
 * effectively an infinite loop. Better to report this as a problem - in DEBUG compilation
 * an assertion fires. In PRODUCTION compilation it does nothing and returns but the
 * initialization has given it a priority that will make the interrupt never be served at
 * all.\n
 *   To implement a real service, you would replace the default handler by your service
 * implementation using ihw_installINTCInterruptHandler().
 */
void ihw_dummyINTCInterruptHandler(void)
{
    /* If this assertion fired then you enabled an interrupt on hardware level (I/O device
       configuration) but you didn't use ihw_installINTCInterruptHandler() in your code to
       install an adequate service handler for it.
         You can find the address of the interrupt vector in register INTC_IACKR_PRC0, or
       0xfff48010. Subtract the address of the SW vector table int_INTCInterruptHandlerAry
       (see application map file) and devide by word size 4; this yields the interrupt
       index, which can be resolved to the interrupt source with help of the MCU reference
       manual, section 28.7, table 28-4. */
#if DEBUG
    /* We put the causing interrupt into a global debug variable for convenience. */
    ihw_idxUnregisteredInterrupt =
                         (INTC.IACKR_PRC0.R - (uint32_t)&int_INTCInterruptHandlerAry[0]) / 4;
    assert(false);
#endif
} /* End of ihw_dummyINTCInterruptHandler */



/**
 * Initialize the interrupt controller INTC. The interrupt table with all user code
 * handlers is initialized o contain a dummy handler for all interrupts and it is then
 * registered at the hardware device INTC for use.\n
 *   The interrupt default handler is ihw_dummyINTCInterruptHandler(). It does nothing in
 * PRODUCTION compilation but an assertion will fire in DEBUG compilation in order to
 * indicate the missing true handler for an enabled interrupt.
 *   Note, this function locally sets but does not touch the enable external interrupts bit
 * in the machine status register. You will call it normally at system startup time, when
 * all interrupts are still disabled, then call ihw_installINTCInterruptHandler()
 * repeatedly for all interrupts your code is interested in and eventually enable the
 * interrupt processing at the CPU.
 */
static void initINTCInterruptController() 
{
    /* Prepare the vector table with all interrupts being served by our problem reporting
       dummy handler. */
    unsigned int u;
    for(u=0; u<sizeOfAry(int_INTCInterruptHandlerAry); ++u)
    {
        /* Note, in DEBUG compilation we configure the dummy handler with a priority that
           will make it used; the reason is that the dummy handler - although it can't
           really do the job of interrupt servicing - can report the problem of a bad
           interrupt configuration in the user code. (It's assumed that debugger is
           available during development time.) In PRODUCTION compilation, the dummy handler
           will never serve because of the priority being zero. */
        ihw_installINTCInterruptHandler( (int_externalInterruptHandler_t)
                                                {.simpleIsr = &ihw_dummyINTCInterruptHandler}
                                       , /* vectorNum */ u
#ifdef DEBUG
                                       , /* psrPriority */ 1
#else
                                       , /* psrPriority */ 0
#endif
                                       , /* isPreemptable */ false
                                       , /* isOsInterrupt */ false
                                       );
    } /* for(All entries in the INTC vector table) */

    /* Normally, this function should always be called at the very first beginning, when
       all interrupts are still globally disabled at the CPU. However, we make it safe
       against deviating code constructs if we locally disable all interrupts. */
    uint32_t msr;
    asm volatile ( /* AssemblerTemplate */
                   "mfmsr %0\n\t"
                   "wrteei 0\n"
                 : /* OutputOperands */ "=r" (msr)
                 : /* InputOperands */
                 : /* Clobbers */
                 );

