PeterVranken/TRK-USB-MPC5643L/LSM/RTuinOS/code/startup/ihw_initMcuCoreHW.c
    /* Block Configuration register, INTC_BCR0
       VTES_PRC0, 0x20: 0 for 4 Byte entries, 1 for 8 Byte entries
       HVEN_PRC0, 0x1, 0: SW vector, 1: HW vector mode */
    INTC.BCR.R = 0;

    /* The address of our vector table is stored in field VTBA_PRC0. Only the most
       significant 21 Bit will matter, the reset will at run-time be replaced by the index
       of the pending interrupt. */
    INTC.IACKR_PRC0.R = (uint32_t)&int_INTCInterruptHandlerAry[0];

    /* The current priority is set to 0. */
    INTC.CPR_PRC0.B.PRI = 0;

    /* Restore the machine status register including the enable external interrupt bit.
       For the normal, intended use case this won't have an effect. */
    asm volatile ( /* AssemblerTemplate */
                   "mbar \n\t"
                   "mtmsr %0\n"
                 : /* OutputOperands */
                 : /* InputOperands */ "r" (msr)
                 : /* Clobbers */
                 );
} /* End of initINTCInterruptController */




/**
 * This function can be used to install an interrupt handler for a given interrupt vector.
 * It will also set the Priority Select Register for the source to the one given.
 *   @param interruptHandler
 * The interrupt handler. An ordinary C function in the user code area, which is called
 * when the according interrupt is served.
 *   @param vectorNum
 * All possible external interrupt sources are hardwired to the interrupt controller. They
 * are indentified by index. The table, which interrupt source (mostly I/O device) is
 * connected to the controller at which index can be found in the MCU reference manual,
 * section 28.7, table 28-4.
 *   @param psrPriority
 * The priority at which the interrupt is served. 0..15. 0 is useless, it would never be
 * served, 1 is the lowest real priority and 15 the highest. Preemption of a handler (if
 * enabled), which serves an interrupt of priority n will be possible only by another
 * interrupt of priority n+1 or higher.\n
 *   Note, kernel interrupts need to use priority 1. This is double-checked by assertion.
 *   @param isPreemptable
 * For each interrupt it can be sayed, whether it is preemptable by other interrupts of
 * higher priority or not. If this is \a false then the interrupt handler will always be
 * entered with the status bit EE reset in the machine status register MSR.\n
 *   Note, a handler, which has been declared non-premptable is allowed to set the EE bit
 * itself. It can thus first do some operations without any race-conditions with other
 * interrupts and then continue without further locking normal interrupt processing.
 *   @param isKernelInterrupt
 * Two types of interrupts are supported. The ordinary behave as usual, they preempt the
 * running context and return to the statement where they had preempted. A kernel relevant
 * interrupt is one, which can decide on return whether to behave like an oridnary one or
 * whether the return to another, currently suspended execution context. Pass \a true if \a
 * interruptHandler denotes a kernel relevant interrupt.\n
 *   Note, the function signature of the handler \a interruptHandler depends on whether it
 * is an ordinary or a kernel relevant interrupt.
 *   @remark
 * The function can be used at any time. It is possible to exchange a handler at run-time,
 * while interrrupts are being processed. However, the normal use case will rather be to
 * call this function for all required interrupts and only then call the other function
 * ihw_resumeAllInterrupts().\n
 *   This function must not be called for an interrupt number n from the context of that
 * interrupt n.
 */
void ihw_installINTCInterruptHandler( int_externalInterruptHandler_t interruptHandler
                                    , unsigned short vectorNum
                                    , unsigned char psrPriority
                                    , bool isPreemptable
                                    , bool isKernelInterrupt
                                    )
{
    /* Test the binary build-up of the interface with the assembly code. The assembler does
       not double-check the data types and code maintenance is not safely possible without
       these compile time tests. */
    INT_STATIC_ASSERT_INTERFACE_CONSISTENCY_C2AS
    
    /* We permit to use this function at any time, i.e. even while interrupts may occur. We
       need to disable them shortly to avoid inconsistent states (vector and priority). */
    uint32_t msr;
    asm volatile ( /* AssemblerTemplate */
                   "mfmsr %0\n\t"
                   "wrteei 0\n"
                 : /* OutputOperands */ "=r" (msr)
                 : /* InputOperands */
                 : /* Clobbers */
                 );

    /* Set the function pointer in the ISR Handler table. We use the two least significant
       bits of the address to store the information about preemption and kernel relevance.
       This convention is known and considered by the assembler code that implements the
       common part of all INTC interrupts. */
    assert(((uintptr_t)interruptHandler.simpleIsr & 0x00000003) == 0);
    if(isKernelInterrupt)
    {
        /* A kernel ISR, which can preempt a context then return to and resume another one. */
        int_ivor4KernelIsr_t isr =
            (int_ivor4KernelIsr_t)((uintptr_t)interruptHandler.kernelIsr | 0x00000001);
        if(isPreemptable)
            isr = (int_ivor4KernelIsr_t)((uintptr_t)isr | 0x00000002);
        
        int_INTCInterruptHandlerAry[vectorNum] =
                                        (int_externalInterruptHandler_t){.kernelIsr = isr};
        
        /* Set the PSR Priority
             The priority ceiling protocol of the INTC doesn't work for kernel interrupts
           and can't be applied to serialilize their servicing. Therefore, we demand that
           all kernel interrupts run on priority 1. */
        assert(psrPriority == 1);
        INTC.PSR[vectorNum].B.PRI = 1;
    }
    else
    {
        /* A simple ISR, which can preempt a context but only return to and resume the same
           context. */
        int_ivor4SimpleIsr_t isr = interruptHandler.simpleIsr;
        if(isPreemptable)
            isr = (int_ivor4SimpleIsr_t)((uintptr_t)isr | 0x00000002);
        
        int_INTCInterruptHandlerAry[vectorNum] =
                                        (int_externalInterruptHandler_t){.simpleIsr = isr};

        /* Set the PSR Priority */
        INTC.PSR[vectorNum].B.PRI = psrPriority;

    } /* End if(Is it a kernel relevant ISR or not?) */

    asm volatile ( /* AssemblerTemplate */
                   "mbar \n\t"
                   "mtmsr %0\n"
                 : /* OutputOperands */
                 : /* InputOperands */ "r" (msr)
                 : /* Clobbers */
                 );
} /* End of ihw_installINTCInterruptHandler */



/**
 * Initialize the MCU core hardware, such that it can be safely operated. This relates
 * mainly to the setup of the clocks and PLLs.\n
 *   Additionally, the INTC is configured to serve all the external interrupts in software
 * vector mode. However, before using an interrupt, you will still have to register your
 * handlers, see ihw_installINTCInterruptHandler().
 *   @remark
 * After return the MCU core is fully operational. Further HW initialization can be done in
 * the user code by implementing dedicated drivers. These will configure the I/O devices,
 * enable their interrupt and register the handler using
 * ihw_installINTCInterruptHandler().\n
 *   After having done this for all required devices the user code will call
 * ihw_enableAllInterrupts() to start full MCU operation.
 *   @remark
 * This code is based on NXP sample MPC5643L-LINFlex-UART-DMA-CW210, file main.c, l. 115ff.
 */
void ihw_initMcuCoreHW(void)
{
    /* Check you have cleared all the faults RGM prior to moving from SAFE/DRUN Modes. */
    if(RGM.FES.B.F_FCCU_SAFE || RGM.FES.B.F_FCCU_HARD)
    {
        RGM.FES.R;
        ME.IMTS.R = 0x00000001;
        clearCriticalFaultFlags();
        clearNonCriticalFaultFlags();
        RGM.FES.R = 0xFFFF;
        RGM.DES.R = 0xFFFF;
    }

    /* Initialize the clocks.
         Clock signal output is useless, the CPU pin BP6 is not connected on our eval
       board. */
    initModesAndClks(/* enableClkOutputAtPB6 */ false);

    /* Grant access to the bus masters to the peripherals, particularly CPU and DMA. */
    initPBridge();
    
    /* Initialize the interrupt controller for the external interrupts. No interrupts are
       enabled but the mechansim is in place to register handlers from the user code. */
    initINTCInterruptController();

    /* From here on the MCU is fully operational. Further HW initialization can be done in
       dedicated driver implementations according to the applictaion needs. */

} /* End of ihw_initMcuCoreHW */



